import pandas as pd
from numpy import nan
from pandas._libs.tslibs.timestamps import Timestamp

collection_test1 = {
    "סימול האוסף": {0: "ArBe"},
    "סימול מקורי": {0: nan},
    "רמת תיאור": {0: "אוסף"},
    "שם האוסף": {0: "אוסף דוד בסט"},
    "תאריך חופשי": {0: "1946-1998"},
    "יוצרי האוסף": {
        0: "בסט, דוד [יוצר האוסף];דוד בסט אדריכלים ומתכנני ערים [יוצרי האוסף]"
    },
    "מילות מפתח_אישי ליבה": {
        0: "אייל, אדם [אדריכל];ספדיה, משה [אדריכל];חשמן, יצחק [אדריכל];שריג, גדעון [אדריכל נוף]"
    },
    "מילות מפתח_מוסדות ליבה": {
        0: 'דוד בסט אדריכל ומתכנן ערים בע"מ [תאגיד];אדם אייל ודוד בסט אדריכלים ומתככני ערים [תאגיד];ד. בסט מ. ספדיה אדריכלים [תאגיד];דוד בסט אדריכל ומתכנן ערים בע"מ [תאגיד];דוד בסט י. חשמן אדריכלים [תאגיד]'
    },
    "מילות מפתח_יצירות ליבה": {
        0: 'בנייני מגורים פיתוח אבטיפוס לבית ולבינוי, אזור השפלה;תכנון כולל, איילת השחר;טיפוסי מגורים, איילת השחר;בית גדל, אילת;הצעה לתכנון אנדרטה פדרלית במסגרת הלימודים באוניברסיטת מנצ\'סטר, אנגליה;הצעה לתכנון מרכז ספורט ופנאי במסגרת הלימודים באוניברסיטת מנצ\'סטר, אנגליה;הצעה לתכנון קריה אוניברסיטאית בירושלים במסגרת הלימודים באוניברסיטת מנצ\'סטר, אנגליה;רובע ב\', אריאל;תכנון כולל, אריאל;בית גבוה בשכונת אפרידר, אשקלון;שיקום שכונת גבעות דרומיות, אשקלון;פרויקט תעשייה עתירת מידע, באר יעקב;היאחזות הנח"ל, באר צופר;בית החייל, באר שבע;הצעה לתכנון בית קשישים, באר שבע;נאות ענבלים, באר שבע;שיכון חיסכון בשכונה ג\', באר שבע;בית ספר הדסה נעורים, בית ינאי;טיפוסי מגורים, בני יהודה;תכנון כולל, גבעות;בית אבות משען, גבעתיים;היכל הספורט, גבעתיים;בית ספר "קרת" גבעתיים;בית החולים הגריאטרי ע"ש הרצפלד, גדרה;אולם רב תכליתי, גונן;חדר אוכל, גונן;טיפוסי מגורים, גונן;תכנון כולל, גונן;תכנון כולל, גרנות הגליל;תכנון מרכז ישוב, גרנות הגליל;בית קולנוע, דימונה;בניין מגורים עבור חברת סובטרום, דימונה;טיפוסי מגורים בשכונה מזרחית, דימונה;טיפוסי מגורים בשכונת נוה דוד, דימונה;שכונה מזרחית, דימונה;שכונת הבריכות, דימונה;תכנון כולל, דימונה;תכנון עבור חברת שיינמיקר, הולנד;תכנית מתאר 2400, הרצליה;בית הבראה מבטחים, זכרון יעקב;תכנון אזורי, חבל לכיש;בית אבות משען, חולון;מפעל כרומת, חולון;בית אבות משען כרמל, חיפה;הצעה לתכנון הפקולטה לאדריכלות בטכניון, חיפה;הצעה לתכנון מעונות סטודנטים בקמפוס הטכניון, חיפה;משרדים בנמל, חיפה;הצעה לתכנון מוזיאון חיל האויר, חצרים;הצעה לתכנון מרכז אזרחי בטייצ\'ונג, טיוואן;אזור מלאכה, יבנה;בית בסט, יבנה;מבנה חנויות, יבנה;מבנה עבור חברת רמט, יבנה;מע"ר, יבנה;שדרות העצמאות, יבנה;תכנון כולל, יבנה;טיפת חלב, יובל;מרפאה, יובל;חדר אוכל, יפתח;תכנון כולל, יפתח;טיפוסי בניינים בשכונת שער הגיא, יקנעם;שכונת שער הגיא, יקנעם;תכנון כולל, יקנעם;הצעה לתכנון בית ספר, יקנעם;בית אבות בתלפיות מזרח, ירושלים;בית אלרוד בתלפיות מזרח, ירושלים;בית מינסטר, ירושלים;בית ספר יסודי מס. 1 בתלפיות מזרח, ירושלים;בית ספר מקיף בתלפיות מזרח, ירושלים;בית ספר ע"ש סליגסברג בשכונת תלפיות מזרח, ירושלים;גני ילדים בתלפיות מזרח, ירושלים;טיפוסי מגורים בתלפיות מזרח, ירושלים;מבנה חינוך בתלפיות מזרח, ירושלים;מעון עולים בתלפיות מזרח, ירושלים;מרכז קהילתי בתלפיות מזרח, ירושלים;קוטג\'ים בתלפיות מזרח, ירושלים;תכנון כולל בתלפיות מזרח, ירושלים;הצעה לתכנון מרכז מסחרי בתלפיות מזרח, ירושלים;בית אגיון, ירושלים;בית ברחוב מטודלה, ירושלים;בית הכנסת בקמפוס האוניברסיטה העברית בגבעת רם, ירושלים;בית חולים הדסה בהר הצופים, ירושלים;בית חולים משגב לדך בעיר העתיקה, ירושלים;בית ספר לאילמים חרשים בקרית יובל, ירושלים;בניין המוסדות הלאומיים, ירושלים;בניין המתמטיקה בקמפוס האוניברסיטה העברית, ירושלים;גוש 35 בעיר העתיקה, ירושלים;היברו יוניון קולג\', ירושלים;המכון לחקר העדה הספרדית ברובע היהודי, ירושלים;הצעה לשיקום בניין בצלאל ההיסטורי, ירושלים;הצעה לתכנון בית הספר המקיף "דנמרק", ירושלים;הצעה לתכנון בית הספרים הלאומי והאוניברסיטאי בקמפוס האוניברסיטה העברית בגבעת רם, ירושלים;הצעה לתכנון ההיברו יוניון קולג\', ירושלים;הצעה לתכנית אב חדשה לקמפוס האוניברסיטה העברית בגבעת רם, ירושלים;הרחבת בתים של חברת עמידר בשכונת קרית יובל, ירושלים;טיילת ארמון הנציב, ירושלים;טרמינל העיר העתיקה, ירושלים;ישיבת פורת יוסף בעיר העתיקה, ירושלים;מבנה לא מזוהה בעיר העתיקה, ירושלים;מוזיאון ישראל, ירושלים;מע"ר, ירושלים;מעונות עובדים ב\' ברחוב עזה, ירושלים;שכונת רמות, ירושלים;תכנון אזור תעשייה, ירושלים;שיקום שכונת ממילא, ירושלים;תכנון ושיקום הרובע היהודי, ירושלים;תכנון כולל, ירושלים;תכנית אב, כפר כנא;תכנון אזורי, כפר סבא;בית במושב בשיטת מודול בטון, ללא מיקום;בית במושב, ללא מיקום;בית גדל טורי, ללא מיקום;בית גדל, ללא מיקום;בית פריקסט, ללא מיקום;בנייה כפרית עבור חברת סובטרום, ללא מיקום;הביטאט ישראל, ללא מיקום;טיפוס מגורים במושב, ללא מיקום;מערכת יחידה, ללא מיקום;תכנון מבנים טרומים, ללא מיקום;אזור תעשייה, מגדל עוז;מרכז רכיבה, מועצה אזורית גליל תחתון;הצעה לתכנון בית ספר במתחם נאמן, מועצה אזורית מטה אשר;תכנון כולל, מחולה ד\';בה"ד 6, מיקום לא ידוע;בית כנסת, מיקום לא ידוע;בית מדורג, מיקום לא ידוע;בית מספר 7, מיקום לא ידוע;בית ספר, מיקום לא ידוע;בניין לזוגות צעירים, מיקום לא ידוע;דיור מוגן, מיקום לא ידוע;הצעה לתכנון יד זיכרון לחללי קהילת המודיעין בישראל, מיקום לא ידוע;חנויות, מיקום לא ידוע;יצירה לא מזוהה, מיקום לא ידוע;מבנה חינוך וקהילה לא מזוהה, מיקום לא ידוע;מרפאה וטיפת חלב כפרית, מיקום לא ידוע;שיכון מזרח, מיקום לא ידוע;בית נעורים, מעלה החמישה;שיכון ותיקים, מעלה החמישה;תכנון כולל, מעלה החמישה;מסעדה, מצפה רמון;בניין משרדים עבור חברת ישאסבסט, נהריה;מגרש הוקי רולר, נס ציונה;בית ספר מקיף, נצרת עלית;מבנה מגורים עבור חברת פריקסט, נתיבות;שיכון סלע, נתניה;מרכז ספורט, סאסא;טיפוסי מגורים, סופה;תכנון כולל באבו רודס, סיני;בית זכרון ע"ש שלמה לביא, עין חרוד;תחרות תכנון שכונה מזרחית, עראבה;אולם התעמלות ברובע חלמיש, ערד;בית ספר יסודי ברובע חלמיש, ערד;גן ילדים ברובע חלמיש, ערד;טיפוסי מגורים ברובע אבישור, ערד;טיפוסי מגורים, ערד;רובע אבישור, ערד;רובע חלמיש, ערד;רובע יעלים, ערד;שיכון חיסכון, ערד;שכונת טללים, ערד;תכנון כולל, ערד;חדר אוכל, צאלים;טיפוסי מגורים, צאלים;שכונה חדשה, צאלים;תכנון כולל, צאלים;פרויקט לא מזוהה, עובדה;פרויקט לא מזוהה, צור הדסה;שכונת כתרון, צור הדסה;תכנון כולל, צור הדסה;בית החולים ע"ש זיו, צפת;שיכון חסכון, צפת;סקר מבנים, קונטרה;שיקום בתים, קונטרה;בתי אטריום, קיסריה;וילות, קיסריה;מלון גולף, קיסריה;תכנון כולל בניקוסיה, קפריסין;מבנה לא מזוהה, ראש העין;מרכז מסחרי בשכונת גבעת טל, ראש העין;תכנון כולל, ראש העין;דיור מוגן, ראשון לציון;בית ויצמן, רחובות;תעשיות עתירות מדע, רחובות;בנייה רוויה, רמלה;מבני מגורים עבור חברת סובטרום בנוה דוד, רמלה;מגורים ברחוב הרצל, רמלה;נוה דוד, רמלה;קוטג\'ים, רמלה;רמת דוד, רמלה;נוה הוד, רמלה;בית אבות משען ברמת אפעל, רמת גן;בית בסט בשכונת רמת חן, רמת גן;בית ספר "מכלל", רמת גן;בית ספר עירוני מקיף דתי, רמת גן;תכנון אזורי, רמת הגולן;בית משפחת בן נון, רמת השרון;בית כנסת, רמת מגשימים;בית מגורים, רמת מגשימים;בית מגשימים, רמת מגשימים;גן ילדים, רמת מגשימים;טיפוסי מגורים, רמת מגשימים;מבנה לא מזוהה, רמת מגשימים;מגורים מודולרים, רמת מגשימים;מועדון, רמת מגשימים;מזכירות, רמת מגשימים;מרפאה, רמת מגשימים;תכנון כולל, רמת מגשימים;הצעה לתכנון אקדמיה למוזיקה, שדרות;פרויקט לא מזוהה, שדרות;שדרות בן גוריון, שדרות;שכונת מגורים קסדור, שדרות;תכנון כולל, שדרות;בית אבות משען בשכונת אפקה, תל אביב;בית אל על, תל אביב;בית אנג\'ל, תל אביב;בית ביאליק, תל אביב;בית מגורים ברחוב ליפסקי, תל אביב;בית ספר "עמל" ע"ש ליידי דיוויס, תל אביב;הצעה לתכנון אנדרטה לחללי צה"ל בכיכר מלכי ישראל, תל אביב;הצעה לתכנון מוזיאון תל אביב לאמנות, תל אביב;מלון הילטון, תל אביב;קפה נגה, תל אביב;שיכון לדוגמא בצפון תל אביב, תל אביב;בית ספר י"א, תל אביב'
    },
    "מילות מפתח_נושאי ליבה": {0: nan},
    "היסטוריה ארכיונית": {
        0: "אוסף דוד בסט הכולל מסמכים מנהליים, תכניות אדריכליות, תכתובות, קטעי עיתונות, עלונים, ותצלומים הצטבר בין השנים 1998-1946. האוסף נאסף ונשמר על ידי האדריכל דוד בסט ובהמשך הועבר לבעלותם של בניו, אהוד בסט וזוהר בסט. החומר החל להצטבר במהלך לימודיו של בסט בבית הספר לארכיטקטורה באוניברסיטת מנצ'סטר באנגליה. לאחר מכן נוספו חומרים המתעדים את עבודתו כסגן האדריכל הראשי במשרד השיכון הישראלי, כשותף במשרדי האדריכלות 'אדם אייל-דוד בסט אדריכלים' ו-'בסט אדריכלים בע\"מ' ובתפקידים פדגוגים שונים. במהלך הצטברותו, סודר האוסף על ידי עובדי משרד האדריכלים 'בסט אדריכלים בע\"מ' פי סוגי החומרים שהכיל ועל פי פרויקטים: התכניות האדריכליות אוחסנו בגלילים ובמגירות שרטוט, התצלומים אוחסנו בקלסרים ובתיקיות על פי נושאם והמסמכים האחרים אוחסנו בתיקים על פי פרויקטים. לחומרי האוסף לא הופקו עזרי איתור או קטלוגים כלשהם."
    },
    "תיאור הטיפול באוסף בפרויקט": {
        0: "אוסף דוד בסט סודר לפי המאפיינים הבאים: שלוש חטיבות שהוגדרו על פי הסידור הפיזי המקורי של האוסף: (1) גלילים; (2) מגירות שרטוט; (3) תיקים; ושתי חטיבות שהוגדרו על פי סוגי חומר הקיימים באוסף: (1) תצלומים ו-(2) תכתובות. רישום האוסף נעשה תוך התחשבות בסידורו הפיזי בשל המשך השימוש בו בעבודת המשרד הפעילה. האוסף נרשם באופן מלא ונסרק, למעט פריטים שלא נסרקו בשל כפילויות או בשל ייצוג היצירה בחומרים אחרים הקיימים באוסף. האוסף נרשם ונסרק במהלך החודשים אוגוסט-נובמבר 2017."
    },
    "סוג אוסף": {0: "ארכיון אישי"},
    "היקף": {0: "מאתיים וששה גלילים, שתיים עשרה מגירות שרטוט ועשרות תיקיות."},
    "אוסף פתוח": {0: "כן"},
    "ביבליוגרפיה ומקורות מידע": {
        0: "Best, David. Architecture and Urban Planning - A Memoir. אוחזר לאחרונה מאתר האינטרנט של המשרד 'בסט אדריכלים ומתככני ערים בע\"מ' ב-11/07/2019: http://www.dbestarch.com/eng/book.php"
    },
    "בעלים נוכחי": {0: "משרד האדריכלים 'בסט אדריכלים ומתככני ערים בע\"מ'"},
    "מיקום פיזי": {0: "משרד האדריכלים 'בסט אדריכלים ומתככני ערים בע\"מ'"},
    "חומרים קשורים": {0: nan},
    "הערות - גלוי למשתמש קצה": {0: nan},
    "הערות - לא גלוי למשתמש קצה": {0: nan},
    "שם הרושם": {0: "מיכאל סידור;הדר פורת"},
    "תאריך הרישום": {0: "2017-08"},
}

collection_test2 = {
    "סימול האוסף": {0: "PDoGa"},
    "סימול מקורי": {0: nan},
    "שם האוסף": {0: "דורה גד"},
    "רמת תיאור": {0: "אוסף"},
    "יוצרים": {0: "גד, דורה [אדריכלית]"},
    "תאריך חופשי": {0: "1920/2003"},
    "היסטוריה ארכיונית": {
        0: "אוסף דורה גד החל להצטבר עם ראשית עבודתה כאדריכלית עצמאית במשרד יחזקאל ודורה גד ארכיטקטים בשיתוף האדריכל יחזקאל גולדברג וכולל חומרים מ1930 עד 2003. כמו כן האוסף כולל חומרים מתקופת עבודתה כאדריכלית עצמאית במשרד 'גד-נוי' בשיתוף האדריכל אריה נוי ובמשרד 'דורה גד ארכיטקט, מעצב, מהנדס'. האוסף מכיל שרטוטים, תצלומים, רישומים, תכתובות, פנאלי הגשה, סקיצות ועוד. בין היתר מכיל האוסף ריהוט ופריטים אישיים של גד ממשרדה הפרטי וכן מיוצגים בו פרויקטים לאומיים רבים כמו משכן הכנסת, מוזיאון ישראל ונמל תעופה בן גוריון עליהם הייתה אחראית.האוסף ניתן לחוג לעיצוב פנים של המכללה למנהל באפריל 2009 בעידודו של רן שחורי, מנהל החוג דאז, וסודר לפי פרויקטים במגירות שרטוט. סידור זה נשמר בחלקו במהלך השנים"
    },
    "סוג אוסף": {0: "אוסף אישי בבעלות מוסדית"},
    "שיטת הסידור": {
        0: "האוסף מחולק לארבעה חלקים מרכזיים:אוסף שרטוטים אדריכליים המאורגן ברובו בתיקיות לפי פרויקטים, אוסף תצלומים ושקופיות המאורגן בחלקו לפי פרויקטים ואוסף חומרים טקסטואלים המכיל התכתבויות, פרסומים ומסמכים ואוסף חפצים אישיים ומודלים"
    },
    "היקף": {
        0: "34 מגירות שרטוטים; 24 קופסאות תצלומים אישיים; 8 תיקיות תצלומים ופרסומים; 34 פולדרים של התכתבויות, קבלות ועוד; כ40 כתבי עת; 2 אלבומי תצלומים; כ10חוברות אדריכליות; רהיטים אישיים- שולחן, כיסא משרדי, 4 יחידות מגירות שרטוטים, מגירות משרדיות"
    },
    "אוסף פתוח": {0: "לא"},
    "מילות מפתח_אישי ליבה": {0: nan},
    "מילות מפתח_מוסדות ליבה": {0: nan},
    "מילות מפתח_יצירות ליבה": {0: nan},
    "מילות מפתח_נושאי ליבה": {0: nan},
    "תיאור האוסף בפרויקט תרבות חזותית ואמנויות הבמה": {
        0: 'אוסף דורה גד מורכב משמונה חטיבות המאורגנות על פי סוג חומר: שרטוטים אדריכלים, תצלומים, חולפות וכרזות, התכתבויות ומסמכים, מסמכים אישיים, שקופיות, קטעי עיתונות וחפצים אישיים ומודלים. האוסף נרשם באופן מלא ונסרק, למעט פריטים שאינם נסרקו בשל כפילויות, צנעת הפרט או בשל ייצוג היצירה בחומרים אחרים הקיימים באוסף. רשימת היצירות באוסף נוצרה מתוך החומר הארכיוני ומכילה מידע הקיים בו. בשל סיבות הנוגעות להנגשת האוסף, פוצלו חלק מתיקי התצלומים לתיקי משנה עפ"י הצלם היוצר.'
    },
    "ביבליוגרפיה ומקורות מידע": {
        0: "דורה גד: הנוכחות הישראלית באדריכלות הפנים, רן שחורי (עורך), אדריכלות ישראלית- כתב עת לאדריכלות ועיצוב (תל אביב), 1997."
    },
    "בעלים נוכחי": {0: nan},
    "מיקום פיזי": {0: "בית הספר לעיצוב וחדשנות, קמפוס המסלול האקדמי המכללה למנהל"},
    "חומרים קשורים": {0: nan},
    "מידע נוסף": {0: nan},
    "שם הרושם": {0: "הדר פורת"},
    "תאריך הרישום": {0: Timestamp("2018-09-20 00:00:00")},
}

df_collection_test1 = pd.DataFrame(collection_test1)
df_collection_test2 = pd.DataFrame(collection_test2)

credits_data_without_owner = {
    "סימול האוסף": "ArBe",
    "אשכול": "אדריכלות",
    "שם הארכיון": "ארכיון דוד בסט",
    "שם הארכיון באנגלית": "David Best Archive",
    "קרדיט עברית": "ארכיון דוד בסט, באדיבות אהוד בסט, זמין דיגיטלית במסגרת שיתוף פעולה בין משרד ירושלים ומורשת, הספרייה הלאומית של ישראל, בצלאל אקדמיה לאמנות ועיצוב ירושלים, ומחלקת היודאיקה בספריית אוניברסיטת הרווארד.",
    "קרדיט אנגלית": "The David Best Archive, courtesy of Ehud Best, can now be accessed online as part of  a collaborative initiative between The Ministry of Jerusalem and Heritage, The National Library of Israel, Bezalel Academy of Arts and Design and the Judaica collection at the Harvard University Library.",
    "מיקום הפקדה עבור בעלים נוכחי": "",
    "הערות הילה וצליל ליעל": "",
    "597": "$$aארכיון דוד בסט, באדיבות אהוד בסט, זמין דיגיטלית במסגרת שיתוף פעולה בין משרד ירושלים ומורשת, הספרייה הלאומית של ישראל, בצלאל אקדמיה לאמנות ועיצוב ירושלים, ומחלקת היודאיקה בספריית אוניברסיטת הרווארד.$$bThe David Best Archive, courtesy of Ehud Best, can now be accessed online as part of  a collaborative initiative between The Ministry of Jerusalem and Heritage, The National Library of Israel, Bezalel Academy of Arts and Design and the Judaica collection at the Harvard University Library.",
}

credits_data_with_owner = {
    "אשכול": "אדריכלות",
    "שם הארכיון": "ארכיון דורה גד",
    "שם הארכיון באנגלית": "Dora Gad Archive",
    "קרדיט עברית": 'ארכיון דורה גד, באדיבות המסלול האקדמי המכללה למינהל וארכיון אדריכלות ישראל (אא"י), זמין דיגיטלית במסגרת שיתוף פעולה בין משרד ירושלים ומורשת, הספרייה הלאומית של ישראל, בצלאל אקדמיה לאמנות ועיצוב ירושלים, ומחלקת היודאיקה בספריית אוניברסיטת הרווארד.',
    "קרדיט אנגלית": "The Dora Gad Archive, courtesy of College of Management Academic Studies & The Israel Architecture Archive (IAA), can now be accessed online as part of  a collaborative initiative between The Ministry of Jerusalem and Heritage, The National Library of Israel, Bezalel Academy of Arts and Design and the Judaica collection at the Harvard University Library.",
    "מיקום הפקדה עבור בעלים נוכחי": 'ארכיון אדריכלות ישראל (אא"י)',
    "הערות הילה וצליל ליעל": "",
    "597": '$$aארכיון דורה גד, באדיבות המסלול האקדמי המכללה למינהל וארכיון אדריכלות ישראל (אא"י), זמין דיגיטלית במסגרת שיתוף פעולה בין משרד ירושלים ומורשת, הספרייה הלאומית של ישראל, בצלאל אקדמיה לאמנות ועיצוב ירושלים, ומחלקת היודאיקה בספריית אוניברסיטת הרווארד.$$bThe Dora Gad Archive, courtesy of College of Management Academic Studies & The Israel Architecture Archive (IAA), can now be accessed online as part of  a collaborative initiative between The Ministry of Jerusalem and Heritage, The National Library of Israel, Bezalel Academy of Arts and Design and the Judaica collection at the Harvard University Library.',
}
frame1 = {"ArBe": credits_data_without_owner}
frame2 = {"PDoGa": credits_data_with_owner}

df_credits_data_without_owner_test = pd.DataFrame(frame1).transpose()
df_credits_data_with_owner_test = pd.DataFrame(frame2).transpose()
